jQuery(document).ready(function() {
  var map = null;

  location_array = [["安徽","合肥","一汽奥迪","安徽安迪汽车有限公司","合肥市包河工业园纬一路20号"],
                    ["安徽","合肥","一汽奥迪","合肥恒信德龙奥龙汽车销售服务有限公司","安徽省合肥市庐阳区蒙城北路1111号"],
                    ["福建","福州","上海大众","福建福申汽车销售服务有限公司","福州市仓山区黄山高速公路口华夏汽车城内"],
                    ["福建","厦门","上海大众","福建厦门申闽汽车有限公司","厦门市湖里区嘉禾路807号"],
                    ["甘肃","兰州","上海大众","兰州金达康汽车销售服务有限公司","兰州市安宁区银滩大桥东北侧"],
                    ["甘肃","兰州","一汽奥迪","兰州庞大一众汽车销售服务有限公司","兰州市七里河区南滨河西路西部欢乐园向西2公里"],
                    ["广东","东莞","上海大众","广东省东莞市永轩汽车销售服务有限公司","东莞市塘厦镇东深二路北10号(林村国际汽车城)"],
                    ["广东","广州","上海大众","上海汽车工业供销广东联营公司","广州市白云区机场路888-1086号广东汽车市场内"],
                    ["广东","广州","一汽奥迪","广东君奥汽车贸易有限公司","广州市机场路888号"],
                    ["广东","深圳","上海大众","深圳星时代汽车有限公司","深圳市南山区宝安大道以北双界河边嘉进隆汽车城-01A"],
                    ["广东","深圳","一汽奥迪","深圳市增特汽车贸易有限公司","深圳市福田区福荣路石厦7中队2栋1001"],
                    ["广西","南宁","上海大众","广西建汇汽车销售服务有限公司","南宁市高新区秀厢大道北环路25号"],
                    ["河北","保定","上海大众","保定市聚合汽车维修有限公司","保定市新市区三丰西路466号"],
                    ["河北","石家庄","上海大众","河北众诚汽车贸易有限公司","石家庄市北二环东路86号"],
                    ["河北","唐山","上海大众","唐山光辉汽车销售服务有限公司","唐山市路南区唐柏路58号"],
                    ["河南","洛阳","上海大众","洛阳市德众金茂汽车销售服务有限公司","洛阳市西工区纱厂西路86号"],
                    ["河南","洛阳","一汽奥迪","洛阳市德众金奥汽车销售服务有限公司","洛阳市西工区汉宫路5号"],
                    ["河南","郑州","上海大众","郑州聚龙实业发展有限公司","郑州市商都路与通泰路交叉口"],
                    ["河南","郑州","一汽奥迪","河南省奥鑫汽车销售有限公司","郑州市郑开大道与贾鲁河交叉口向南800米"],
                    ["湖北","武汉","上海大众","武汉长江众发汽车销售服务有限公司","湖北省武汉市洪山区仁和路特一号"],
                    ["湖北","武汉","一汽奥迪","湖北奥泽汽车销售服务有限公司","湖北省武汉市江岸区黄浦科技园特6号"],
                    ["湖北","武汉","一汽奥迪","湖北鼎杰汽车销售服务有限公司","武汉市徐东大街55号"],
                    ["湖南","长沙","上海大众","湖南申湘兴旺销售有限公司","长沙市芙蓉区远大一路598号"],
                    ["吉林","长春","上海大众","长春市金达洲汽车销售有限责任公司","长春市经济技术开发区东南湖大路1181号"],
                    ["吉林","长春","上海大众","长春通立汽车服务有限责任公司","长春市绿园区普阳街68号"],
                    ["江苏","常州","上海大众","常州众恒汽车销售服务有限公司","常州市钟楼经济开发区玉龙南路213号"],
                    ["江苏","淮安","上海大众","淮安市雨田汽车销售服务有限公司","淮安市清河新区旺旺路58号"],
                    ["江苏","南京","上海大众","江苏安吉汽车销售服务有限公司","南京市卡子门大街78号"],
                    ["江苏","南京","上海通用","江苏天泓汽车维修有限公司","南京市红山路十字街3号"],
                    ["江苏","南京","一汽奥迪","江苏天奥汽车销售服务有限公司","南京市江宁区东麒路汽车4S园1号"],
                    ["江苏","南通","上海大众","南通宝腾汽车销售服务有限公司","南通市长江中路129号"],
                    ["江苏","苏州","上海大众","苏州华丰汽车销售服务有限公司","苏州市吴东路1388号"],
                    ["江苏","苏州","综合厂","苏州华奥汽车维修服务有限公司","苏州市吴中区兴南路22号"],
                    ["江苏","无锡","上海大众","无锡东方誉众汽车销售服务有限公司","无锡金城东路290号新东方汽车城"],
                    ["江苏","无锡","上海大众","无锡鸿众汽车销售服务有限公司","无锡市金城路388号"],
                    ["江苏","无锡","上海通用","无锡华通汽车销售有限公司","无锡市永乐东路与江海路交叉口"],
                    ["江苏","无锡","上海通用","无锡汇通汽车销售服务有限公司","无锡市滨湖区金城东路与新阳路交叉口"],
                    ["江苏","徐州","上海大众","徐州恒运汽车销售服务有限公司","徐州市云龙区三环东路九七医院招待北侧"],
                    ["江苏","徐州","一汽奥迪","徐州沪彭奥通汽车销售服务有限公司","江苏省徐州市鼓楼区奔腾大道6号"],
                    ["江苏","张家港","上海大众","张家港祥盛汽车销售服务有限公司","江苏省张家港市国泰北路2号"],
                    ["江西","南昌","上海大众","江西广甸宝德汽车销售服务有限公司","南昌市北京东路399号"],
                    ["辽宁","大连","上海大众","大连禾泰汽车销售服务有限公司","大连高新园区黄泥川高新汽车城内"],
                    ["辽宁","葫芦岛","上海大众","葫芦岛川达实业集团","辽宁省葫芦岛市龙港区龙湾大街60号"],
                    ["辽宁","沈阳","上海大众","辽宁鑫达汽车销售服务有限公司","沈阳市于洪区黄河北大街126甲"],
                    ["山东","济南","上海大众","山东齐鲁汽车贸易有限公司","济南市北园大街69号"],
                    ["山东","济南","一汽奥迪","山东银座天尊汽车有限公司","山东省济南市经十路2289号"],
                    ["山东","济南","一汽大众","山东润华天信汽车销售服务有限公司","济南市槐荫区经十西路润华汽车园"],
                    ["山东","济宁","上海大众","济宁交运汽车销售服务有限公司","济宁市中区车站西路18号"],
                    ["山东","济宁","一汽奥迪","济宁裕华汽车销售服务有限公司","济宁市高新区黄屯镇327国道北"],
                    ["山东","青岛","上海大众","青岛晟力达汽车销售服务有限公司","青岛市四方区重庆南路167号"],
                    ["山东","青岛","上海通用","青岛润冠汽车销售服务有限公司","青岛市城阳区黑龙江中路385号"],
                    ["山东","潍坊","上海大众","潍坊市国信汽车销售有限公司","潍坊市寒亭区海龙路2618号"],
                    ["山东","烟台","上海大众","烟台吉安汽车销售服务有限公司","烟台市牟平区北关大街756号"],
                    ["山西","太原","上海大众","山西新大洋汽车销售服务有限公司","太原市小店区汾东北路185号"],
                    ["陕西","西安","上海大众","陕西富源汽车销售服务有限公司","西安市南郊丈八东路2号"],
                    ["深圳","深圳","一汽奥迪","深圳市增特汽车贸易有限公司","深圳市福田区福荣路石厦7中队2栋1001"],
                    ["深圳","珠海","上海大众","珠海南方汽车有限公司","珠海市香洲区华宇路97号"],
                    ["四川","成都","上海通用","成都东创建国汽车集团成都天韵车业有限公司","成都市锦江区棬子树村7组底楼"],
                    ["四川","成都","一汽奥迪","四川华星名仕汽车销售服务有限公司","四川省成都市成华区东三环路二段77号(龙潭立交旁)"],
                    ["新疆","喀什","综合厂","喀什市通工实业有限公司","喀什市帕依纳普路249号"],
                    ["新疆","乌鲁木齐","一汽奥迪","乌鲁木齐华奥汽车销售服务有限公司","乌鲁木齐市米东区永顺街1779号"],
                    ["云南","昆明","上海大众","昆明星长征实瑞汽车销售有限公司","昆明市老海埂路200号"],
                    ["浙江","杭州","上海大众","浙江申浙汽车股份有限公司","杭州市石祥路168号"],
                    ["浙江","杭州","上海通用","浙江申通时代汽车销售服务有限公司","浙江省杭州市杭行路199号"],
                    ["浙江","杭州","一汽奥迪","浙江奥通汽车有限公司","杭州市绍兴路428号"],
                    ["浙江","杭州","一汽大众","浙江奥通汽车有限公司","杭州市绍兴路428号"],
                    ["浙江","宁波","上海大众","宁波兴宁达众汽车销售服务有限公司","宁波市江东区兴宁路178号"],
                    ["浙江","宁波","上海大众","宁波兴宁达众汽车销售服务有限公司","宁波市江东区兴宁路178号"],
                    ["浙江","宁波","一汽奥迪","宁波中基汽车销售服务有限公司","宁波市鄞州区下应北路666号"],
                    ["重庆","重庆","一汽奥迪","重庆商社德奥汽车有限公司","重庆市经济技术开发区海峡路300号"],
                    ["上海","上海","全顺","上海三钧汽车销售服务有限公司","上海市杨浦区周家嘴路4230号一楼西侧"],
                    ["上海","上海","宝马","上海宝信汽车服务有限公司","上海市龙吴路900号"],
                    ["上海","上海","一汽奥迪","上海开隆汽车贸易有限公司","上海市吴中路1439号"],
                    ["上海","上海","奔驰","上海东驰汽车有限公司","上海市康梧路386号"],
                    ["上海","上海","通用","上海锦江通永汽车销售服务有限公司----维修","上海市宋园路166号"],
                    ["上海","上海","依维柯","上海衡汽车辆修理有限公司","上海市杨浦区民星路93-3号"],
                    ["上海","上海","一汽奥迪","上海宝友汽车销售服务有限公司","上海市宝山区同济路651弄11号"],
                    ["上海","上海","车辆验车","上海卢湾汽车检测维修有限公司","上海市卢湾区重庆南路275号"],
                    ["上海","上海","装潢","上海四融汽车技术服务有限公司","上海市普陀区柳园路588号7幢51室"],
                    ["上海","上海","大众","上海锦江汽车销售服务有限公司","上海市宋园路178号"],
                    ["上海","上海","通用","上海锦江通永汽车销售服务有限公司","上海市宋园路166号"],
                    ["上海","上海","丰田","上海申晖丰田汽车销售服务有限公司","上海市普陀区真南路818号"],
                    ["上海","上海","英伦","上海华庭汽车销售服务有限公司","上海市闵行区华翔路3660号1-3幢"],
                    ["上海","上海","车辆牵引","上海家磊汽车运输有限公司","上海市真南路4288号"],
                    ["上海","上海","车辆牵引","上海安畅汽车牵引有限公司","上海市宝山区沪太路8885号"],
                    ["上海","上海","中、大型客车维修","上海世发汽车维修有限公司","上海市虹梅南路1528弄88号"],
                    ["上海","上海","综合厂","上海强生集团汽车修理有限公司","上海民府路90号"],
                    ["上海","上海","综合厂","上海上强高级汽车修理有限公司","上海沪太路798号"],
                    ["上海","上海","通用","上海强生北美汽车销售服务有限公司","上海市沪太路800号"],
                    ["上海","上海","一汽奥迪","上海君奥达汽车服务有限公司","上海市真北路1015号"],
                    ["上海","上海","大通","上海鑫桥汽车维修公司","上海市金沪路1118号"],
                    ["上海","上海","中、大型客车维修","上海巴士客车维修有限公司","上海市宝山区宝杨路2000号4橦305-307室"],
                    ["上海","上海","丰田","上海徐汇开隆汽车销售服务有限公司","上海市龙吴路900号"],
                    ["上海","上海","奔驰","上海德骏汽车有限公司","上海市真北路3265号"],
                    ["上海","上海","沃尔沃","上海永达奥迪汽车销售服务中心－沪南店","上海市浦东新区沪南公路2178号"],
                    ["上海","上海","沃尔沃","上海西上海嘉沃汽车销售服务有限公司-----维修","上海市嘉定区永盛路2018号3幢"],
                    ["上海","上海","奔驰","上海平治汽车贸易有限公司","上海市真北路3251号"],
                    ["上海","上海","丰田","上海冠松丰田汽车销售服务有限公司-------维修","上海市淞沪路718号"],
                    ["上海","上海","综合厂","上海大众交通市中汽车销售服务有限公司","上海市汶水路451号"],
                    ["上海","上海","中、大型客车维修","上海上勤汽车维修有限公司","上海市万荣路一号120弄"],
                    ["上海","上海","综合厂","上海德携擎汽配有限公司","上海市闵行区中春路7228号"],
                    ["上海","上海","通用","上海东昌金桥汽车服务有限公司","上海市锦绣东路2069号"],
                    ["上海","上海","本田","上海永达汽车经营服务有限公司------维修","上海市闵行区漕宝路1200号"],
                    ["上海","上海","宝马","上海宝诚汽车销售服务有限公司-----维修","上海浦东龙东大道2777号"],
                    ["上海","上海","通用","上海东昌汽车服务有限公司----维修","上海市浦建路1285号"],
                    ["上海","上海","综合厂","上海协源轿车修理有限公司","上海市吴中路990号"],
                    ["上海","上海","综合厂","上海协源轿车修理有限公司","上海市翔殷路155号"],
                    ["上海","上海","上海大众","上海申银汽车服务有限公司","上海市中山北路2500号"],
                    ["上海","上海","奔驰","上海银佳汽车销售服务有限公司","上海市浦东新区御桥路1388号"],
                    ["上海","上海","德国大众","上海中进众旺汽车销售服务有限公司","上海市宝山区江杨南路1381号"],
                    ["广东","东莞","上海大众","东莞市鸿鹰汽车销售服务有限公司","东莞南城区莞太路白马路段"],
                    ["河北","廊坊","长城","廊坊罗马汽车维修中心","廊坊市广阳区裕华西路西侧20号"],
                    ["上海","上海","一汽丰田","上海锦江丰田汽车销售有限公司","上海市吴中路88号"]];

    
    loadCity();
    loadProductByCity("0")
    mapInit();
    $("#select_city").change(function(){
      loadProductByCity($(this).val());
    });
    $("#btn_search").click(function(e){
      mapInit();
    });
});

function mapInit(){
  map = new BMap.Map("allmap");
  map.enableDragging();
  map.enableScrollWheelZoom();
  var point = new BMap.Point(113.621711, 34.750707348246);
  map.centerAndZoom(point,6);
  geocodeSearch($("#select_city").val(),$("#select_product").val());
}

function geocodeSearch(city, product){
  addressArry = [];
  if(city == "0" && product == "0"){
    addressToGeo(location_array, false);
  }else{
    var cityArray =[];productArray = []
    var isshow = false;
    if(city != "0"){
      isshow = true;
      cityArray = $.grep(location_array, function(item, i){
        return item[0] == city
      });
      if(product != 0){
        productArray = $.grep(cityArray, function(item, i){
          return item[2] == product
        });
      }
      else{
        productArray = cityArray;
      }
    }else{
      if(product != 0){
        productArray = $.grep(location_array, function(item, i){
          return item[2] == product
        });
      }
      else{
        productArray = location_array;
      }
    }

    addressToGeo(productArray, isshow);
  }
}

function addressToGeo(addressArry, isall){
  var myGeo = new BMap.Geocoder();
  $.each(addressArry, function(i, item){
    var address = item[4];
    myGeo.getPoint(address, function(point){
      if (point) {
        if(isall){
          map.centerAndZoom(point,12);
        }
        var marker = new BMap.Marker(point)
        map.addOverlay(marker);
        var sContent = "<h4 style='margin:0 0 5px 0;padding:0.2em 0'>" + item[2] + "</h4>" + 
              "<p style='margin:0;line-height:1.5;font-size:13px;text-indent:2em'>企业名称: "+ item[3] +"</p>" + 
              "<p style='margin:0;line-height:1.5;font-size:13px;text-indent:2em'>地址: "+ item[4] +"</p>" + 
              "</div>";
        var infoWindow = new BMap.InfoWindow(sContent);  // 创建信息窗口对象
        marker.addEventListener("click", function(){
           this.openInfoWindow(infoWindow);
        });

      }
    }, "北京市");
  });
}

function loadCity(){
  var cityArr = [];
  var optionStr = "<option value='0'>所有省份</option>";
  $.each(location_array, function(i, el){
    if($.inArray(el[0], cityArr) === -1) cityArr.push(el[0]);
  });
  
  $.each(cityArr, function(index, value){
    optionStr += "<option value='"+ value +"'>"+ value +"</option>"
  });
  
  $("#select_city").prepend(optionStr);
  $("#select_product").prepend("<option value='0'>所有品牌</option>");
}

function loadProductByCity(cityname){
  var productArr = [];
  var optionStr = "<option value='0'>所有品牌</option>";
  if(cityname != "0"){
    var result = $.grep(location_array, function(item, i){
      return item[0] == cityname
    });

    $.each(result, function(i, el){
      if($.inArray(el[2], productArr) === -1) productArr.push(el[2]);
    });

    $.each(productArr, function(index, value){
      optionStr += "<option value='"+ value +"'>"+ value +"</option>"
    });
  }else{
    $.each(location_array, function(i, el){
      if($.inArray(el[2], productArr) === -1) productArr.push(el[2]);
    });
    $.each(productArr, function(index, value){
      optionStr += "<option value='"+ value +"'>"+ value +"</option>"
    });
  }
  $("#select_product").empty();
  $("#select_product").prepend(optionStr);
}